SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_modem.h
  __IOM uint32_t            ADPC10;              /**< ADPC10                                             */
  uint32_t                  RESERVED6[6U];       /**< Reserved for future use                            */
  uint32_t                  RESERVED7[1U];       /**< Reserved for future use                            */
  uint32_t                  RESERVED8[15U];      /**< Reserved for future use                            */
  __IOM uint32_t            HADMCTRL0;           /**< HADM Control                                       */
  __IOM uint32_t            HADMCTRL1;           /**< HADM Control 1                                     */
  __IM uint32_t             HADMSTATUS0;         /**< HADM Status                                        */
  __IM uint32_t             HADMSTATUS1;         /**< HADM Status 1                                      */
  __IM uint32_t             HADMSTATUS2;         /**< HADM Status 2                                      */
  __IM uint32_t             HADMSTATUS3;         /**< HADM Status 3                                      */
  __IM uint32_t             HADMSTATUS4;         /**< HADM Status 4                                      */
  __IM uint32_t             HADMSTATUS5;         /**< HADM Status 5                                      */
  __IM uint32_t             HADMSTATUS6;         /**< HADM Status 6                                      */
  uint32_t                  RESERVED9[3U];       /**< Reserved for future use                            */
  __IOM uint32_t            SRC2NCOCTRL;         /**< SRC2 NCO  CTRL                                     */
  uint32_t                  RESERVED10[7U];      /**< Reserved for future use                            */
  __IOM uint32_t            SPARE;               /**< Spare register                                     */
  uint32_t                  RESERVED11[767U];    /**< Reserved for future use                            */
  __IM uint32_t             IPVERSION_SET;       /**< IP Version                                         */
  __IOM uint32_t            EN_SET;              /**< Enable peripheral clock to this module             */
  __IOM uint32_t            IF_SET;              /**< Interrupt Flags                                    */
  __IOM uint32_t            IEN_SET;             /**< Interrupt Enable                                   */
  __IOM uint32_t            SEQIF_SET;           /**< SEQ Interrupt Flags                                */
  __IOM uint32_t            SEQIEN_SET;          /**< SEQ Interrupt Enable                               */
  __IM uint32_t             STATUS_SET;          /**< Status Register                                    */
  __IM uint32_t             STATUS2_SET;         /**< Status Register 2                                  */
  __IM uint32_t             STATUS3_SET;         /**< Status Register 3                                  */
  __IM uint32_t             STATUS4_SET;         /**< ANT DIV RSSI Status                                */
  __IM uint32_t             STATUS5_SET;         /**< Collision restart status                           */
  __IM uint32_t             STATUS6_SET;         /**< ANT DIV Correlation Status                         */
  __IM uint32_t             STATUS7_SET;         /**< PHASE Demod Status                                 */
  __IM uint32_t             TIMDETSTATUS_SET;    /**< Timing Detection Status Register                   */
  __IM uint32_t             FSMSTATUS_SET;       /**< Demod FSM Status Register                          */
  __IM uint32_t             FREQOFFEST_SET;      /**< Frequency Offset Estimate                          */
  __IOM uint32_t            AFCADJRX_SET;        /**< AFC Adjustment RX                                  */
  __IOM uint32_t            AFCADJTX_SET;        /**< AFC Adjustment TX                                  */
  __IOM uint32_t            MIXCTRL_SET;         /**< Analog mixer control                               */
  __IOM uint32_t            CTRL0_SET;           /**< Control Register 0                                 */
  __IOM uint32_t            CTRL1_SET;           /**< Control Register 1                                 */
  __IOM uint32_t            CTRL2_SET;           /**< Control Register 2                                 */
  __IOM uint32_t            CTRL3_SET;           /**< Control Register 3                                 */
  __IOM uint32_t            CTRL4_SET;           /**< Control Register 4                                 */
  __IOM uint32_t            CTRL5_SET;           /**< Control Register 5                                 */
  __IOM uint32_t            CTRL6_SET;           /**< Control Register 6                                 */
  __IOM uint32_t            TXBR_SET;            /**< Transmit baudrate                                  */
  __IOM uint32_t            RXBR_SET;            /**< Receive Baudrate                                   */
  __IOM uint32_t            CF_SET;              /**< Channel Filter                                     */
  __IOM uint32_t            PRE_SET;             /**< Preamble Register                                  */
  __IOM uint32_t            SYNC0_SET;           /**< Sync word 0                                        */
  __IOM uint32_t            SYNC1_SET;           /**< Sync word 1                                        */
  __IOM uint32_t            TIMING_SET;          /**< Timing Register                                    */
  __IOM uint32_t            DSSS0_SET;           /**< DSSS symbol 0 Register                             */
  __IOM uint32_t            MODINDEX_SET;        /**< Modulation Index                                   */
  __IOM uint32_t            AFC_SET;             /**< Automatic Frequency Control                        */
  __IOM uint32_t            AFCADJLIM_SET;       /**< AFC Adjustment Limit                               */
  __IOM uint32_t            SHAPING0_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING1_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING2_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING3_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING4_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING5_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING6_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING7_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING8_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING9_SET;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING10_SET;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING11_SET;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING12_SET;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING13_SET;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING14_SET;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING15_SET;       /**< Shaping Coefficients                               */
  uint32_t                  RESERVED12[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            RAMPCTRL_SET;        /**< Ramping Register                                   */
  __IOM uint32_t            RAMPLEV_SET;         /**< Ramping Register                                   */
  __IOM uint32_t            ANARAMPCTRL_SET;     /**< Analog Ramping Control                             */
  uint32_t                  RESERVED13[11U];     /**< Reserved for future use                            */
  __IOM uint32_t            DCCOMP_SET;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t            DCCOMPFILTINIT_SET;  /**< DC Offset compensation Filter                      */
  __IM uint32_t             DCESTI_SET;          /**< DC Offset Estimated value                          */
  __IOM uint32_t            SRCCHF_SET;          /**< SRC ratio values and channel filter                */
  __IOM uint32_t            INTAFC_SET;          /**< Internal AFC                                       */
  __IOM uint32_t            DSATHD0_SET;         /**< DSA detector threshold-0                           */
  __IOM uint32_t            DSATHD1_SET;         /**< DSA detector threshold-1                           */
  __IOM uint32_t            DSATHD2_SET;         /**< DSA detector threshold-2                           */
  __IOM uint32_t            DSATHD3_SET;         /**< DSA detector threshold 3                           */
  __IOM uint32_t            DSATHD4_SET;         /**< DSA detector threshold 4                           */
  __IOM uint32_t            DSACTRL_SET;         /**< DSA mode                                           */
  __IOM uint32_t            DIGMIXCTRL_SET;      /**< Digital mixer control register                     */
  __IOM uint32_t            VITERBIDEMOD_SET;    /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG0_SET;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG1_SET;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTTRACK_SET;         /**< Viterbi demodulator tracking loop                  */
  __IOM uint32_t            VTBLETIMING_SET;     /**< Viterbi BLE timing stamp control                   */
  __IM uint32_t             BREST_SET;           /**< Baudrate Estimate                                  */
  __IOM uint32_t            AUTOCG_SET;          /**< Automatic clock gating                             */
  __IOM uint32_t            CGCLKSTOP_SET;       /**< Automatic clock gating                             */
  __IM uint32_t             POE_SET;             /**< Phase Offset Estimate                              */
  __IOM uint32_t            DIRECTMODE_SET;      /**< Direct Mode Control                                */
  __IOM uint32_t            LONGRANGE_SET;       /**< BLE Long Range                                     */
  __IOM uint32_t            LONGRANGE1_SET;      /**< BLE Long Range Set1                                */
  __IOM uint32_t            LONGRANGE2_SET;      /**< BLE Long Range Set2                                */
  __IOM uint32_t            LONGRANGE3_SET;      /**< BLE Long Range Set3                                */
  __IOM uint32_t            LONGRANGE4_SET;      /**< BLE Long Range Set4                                */
  __IOM uint32_t            LONGRANGE5_SET;      /**< BLE Long Range Set5                                */
  __IOM uint32_t            LONGRANGE6_SET;      /**< BLE Long Range Set6                                */
  __IOM uint32_t            LRFRC_SET;           /**< BLE Long Range FRC interface                       */
  __IOM uint32_t            COH0_SET;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH1_SET;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH2_SET;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            COH3_SET;            /**< Coherent demodulator control signals               */
  __IOM uint32_t            CMD_SET;             /**< Command register                                   */
  uint32_t                  RESERVED14[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            SYNCPROPERTIES_SET;  /**< Sync word properties                               */
  __IOM uint32_t            DIGIGAINCTRL_SET;    /**< Digital Gain Control                               */
  __IOM uint32_t            PRSCTRL_SET;         /**< Mux control for PRS outputs                        */
  uint32_t                  RESERVED15[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            REALTIMCFE_SET;      /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t            ETSCTRL_SET;         /**< Early Time Stamp Control                           */
  __IOM uint32_t            ETSTIM_SET;          /**< Early Time Stamp Timing                            */
  __IOM uint32_t            ANTSWCTRL_SET;       /**< Antenna Switch Control                             */
  __IOM uint32_t            ANTSWCTRL1_SET;      /**< Antenna Switch Control 1                           */
  __IOM uint32_t            ANTSWSTART_SET;      /**< Antenna Switch Start                               */
  __IOM uint32_t            ANTSWEND_SET;        /**< Antenna Switch End                                 */
  __IOM uint32_t            TRECPMPATT_SET;      /**< TRECS Preamble pattern                             */
  __IOM uint32_t            TRECPMDET_SET;       /**< TRECS preamble Detection CTRL                      */
  __IOM uint32_t            TRECSCFG_SET;        /**< TRECS configuration                                */
  __IOM uint32_t            CFGANTPATT_SET;      /**< Configure Antenna Pattern                          */
  __IOM uint32_t            COCURRMODE_SET;      /**< CONCURRENT MODE                                    */
  __IOM uint32_t            CHFCOE00_SET;        /**< CHF COE. Set0 group0                               */
  __IOM uint32_t            CHFCOE01_SET;        /**< CHF COE. Set0 group1                               */
  __IOM uint32_t            CHFCOE02_SET;        /**< CHF COE. Set0 group2                               */
  __IOM uint32_t            CHFCOE03_SET;        /**< CHF COE. Set0 group3                               */
  __IOM uint32_t            CHFCOE04_SET;        /**< CHF COE. Set0 group4                               */
  __IOM uint32_t            CHFCOE05_SET;        /**< CHF COE. Set0 group5                               */
  __IOM uint32_t            CHFCOE06_SET;        /**< CHF COE. Set0 group6                               */
  __IOM uint32_t            CHFCOE10_SET;        /**< CHF COE. Set1 group0                               */
  __IOM uint32_t            CHFCOE11_SET;        /**< CHF COE. Set1 group1                               */
  __IOM uint32_t            CHFCOE12_SET;        /**< CHF COE. Set1 group2                               */
  __IOM uint32_t            CHFCOE13_SET;        /**< CHF COE. Set1 group3                               */
  __IOM uint32_t            CHFCOE14_SET;        /**< CHF COE. Set1 group4                               */
  __IOM uint32_t            CHFCOE15_SET;        /**< CHF COE. Set1 group5                               */
  __IOM uint32_t            CHFCOE16_SET;        /**< CHF COE. Set1 group6                               */
  __IOM uint32_t            CHFCTRL_SET;         /**< CHF control                                        */
  __IOM uint32_t            CHFLATENCYCTRL_SET;  /**< CHF Latency Control                                */
  __IOM uint32_t            FRMSCHTIME_SET;      /**< FRAM SCH TIME-OUT length                           */
  __IOM uint32_t            PREFILTCOEFF_SET;    /**< Preamble Filter Coefficients                       */
  __IOM uint32_t            RXRESTART_SET;       /**< Collision restart control                          */
  __IOM uint32_t            SQ_SET;              /**< Preamble Sense Mode                                */
  __IOM uint32_t            SQEXT_SET;           /**< Preamble Sense Mode EXT                            */
  __IOM uint32_t            SQI_SET;             /**< Signal quality indicator                           */
  __IOM uint32_t            ANTDIVCTRL_SET;      /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t            ANTDIVFW_SET;        /**< PHASE DEMOD FW mode                                */
  __IOM uint32_t            PHDMODANTDIV_SET;    /**< PHASE DEMOD ANTENNA DIVSERSITY                     */
  __IOM uint32_t            PHANTDECSION_SET;    /**< PHASE DEMOD ANT-DIV Decision                       */
  __IOM uint32_t            PHDMODCTRL_SET;      /**< PHASE DEMOD CTRL                                   */
  __IOM uint32_t            SICTRL0_SET;         /**< Signal Identifier CTRL0                            */
  __IOM uint32_t            SICTRL1_SET;         /**< Signal Identifier CTRL1                            */
  __IM uint32_t             SISTATUS_SET;        /**< Signal Identifier Status                           */
  __IOM uint32_t            CFGANTPATTEXT_SET;   /**< Configure Antenna Pattern                          */
  uint32_t                  RESERVED16[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            SICTRL2_SET;         /**< Signal Identifier CTRL2                            */
  __IOM uint32_t            CHFSWCTRL_SET;       /**< Channel Filter Switch Time                         */
  uint32_t                  RESERVED17[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            IRCAL_SET;           /**< IRCAL control signals                              */
  __IM uint32_t             IRCALCOEF_SET;       /**< IRCAL COEF values                                  */
  MODEM_IRCALCOEFWR_TypeDef IRCALCOEFWR_SET[2U]; /**< IRCAL COEFS WR per antenna                         */
  __IOM uint32_t            ADCTRL1_SET;         /**< ADCTRL1                                            */
  __IOM uint32_t            ADCTRL2_SET;         /**< ADCTRL2                                            */
  __IM uint32_t             ADQUAL0_SET;         /**< ADQUAL0                                            */
  __IM uint32_t             ADQUAL1_SET;         /**< ADQUAL1                                            */
  __IM uint32_t             ADQUAL2_SET;         /**< ADQUAL2                                            */
  __IM uint32_t             ADQUAL3_SET;         /**< ADQUAL3                                            */
  __IOM uint32_t            ADQUAL4_SET;         /**< ADQUAL4                                            */
  __IOM uint32_t            ADQUAL5_SET;         /**< ADQUAL5                                            */
  __IOM uint32_t            ADQUAL6_SET;         /**< ADQUAL6                                            */
  __IOM uint32_t            ADQUAL7_SET;         /**< ADQUAL7                                            */
  __IOM uint32_t            ADQUAL8_SET;         /**< ADQUAL8                                            */
  __IM uint32_t             ADQUAL9_SET;         /**< ADQUAL9                                            */
  __IM uint32_t             ADQUAL10_SET;        /**< ADQUAL10                                           */
  __IOM uint32_t            ADFSM0_SET;          /**< ADFSM0                                             */
  __IOM uint32_t            ADFSM1_SET;          /**< ADFSM1                                             */
  __IOM uint32_t            ADFSM2_SET;          /**< ADFSM2                                             */
  __IOM uint32_t            ADFSM3_SET;          /**< ADFSM3                                             */
  __IOM uint32_t            ADFSM4_SET;          /**< ADFSM4                                             */
  __IOM uint32_t            ADFSM5_SET;          /**< ADFSM5                                             */
  __IOM uint32_t            ADFSM6_SET;          /**< ADFSM6                                             */
  __IOM uint32_t            ADFSM7_SET;          /**< ADFSM7                                             */
  __IOM uint32_t            ADFSM8_SET;          /**< ADFSM8                                             */
  __IOM uint32_t            ADFSM9_SET;          /**< ADFSM9                                             */
  __IOM uint32_t            ADFSM10_SET;         /**< ADFSM10                                            */
  __IOM uint32_t            ADFSM11_SET;         /**< ADFSM11                                            */
  __IOM uint32_t            ADFSM12_SET;         /**< ADFSM12                                            */
  __IOM uint32_t            ADFSM13_SET;         /**< ADFSM13                                            */
  __IOM uint32_t            ADFSM14_SET;         /**< ADFSM14                                            */
  __IOM uint32_t            ADFSM15_SET;         /**< ADFSM15                                            */
  __IOM uint32_t            ADFSM16_SET;         /**< ADFSM16                                            */
  __IOM uint32_t            ADFSM17_SET;         /**< ADFSM17                                            */
  __IOM uint32_t            ADFSM18_SET;         /**< ADFSM18                                            */
  __IOM uint32_t            ADFSM19_SET;         /**< ADFSM19                                            */
  __IOM uint32_t            ADFSM20_SET;         /**< ADFSM20                                            */
  __IOM uint32_t            ADFSM21_SET;         /**< ADFSM21                                            */
  __IM uint32_t             ADFSM22_SET;         /**< ADFSM22                                            */
  __IOM uint32_t            ADFSM23_SET;         /**< ADFSM23                                            */
  __IOM uint32_t            ADFSM24_SET;         /**< ADFSM24                                            */
  __IOM uint32_t            ADFSM25_SET;         /**< ADFSM25                                            */
  __IOM uint32_t            ADFSM26_SET;         /**< ADFSM26                                            */
  __IOM uint32_t            ADFSM27_SET;         /**< ADFSM27                                            */
  __IOM uint32_t            ADFSM28_SET;         /**< ADFSM28                                            */
  __IOM uint32_t            ADFSM29_SET;         /**< ADFSM29                                            */
  __IOM uint32_t            ADFSM30_SET;         /**< ADFSM30                                            */
  __IOM uint32_t            ADPC1_SET;           /**< ADPC1                                              */
  __IOM uint32_t            ADPC2_SET;           /**< ADPC2                                              */
  __IOM uint32_t            ADPC3_SET;           /**< ADPC3                                              */
  __IOM uint32_t            ADPC4_SET;           /**< ADPC4                                              */
  __IOM uint32_t            ADPC5_SET;           /**< ADPC5                                              */
  __IOM uint32_t            ADPC6_SET;           /**< ADPC6                                              */
  __IOM uint32_t            ADPC7_SET;           /**< ADPC7                                              */
  __IOM uint32_t            ADPC8_SET;           /**< ADPC8                                              */
  __IOM uint32_t            ADPC9_SET;           /**< ADPC9                                              */
  __IOM uint32_t            ADPC10_SET;          /**< ADPC10                                             */
  uint32_t                  RESERVED18[6U];      /**< Reserved for future use                            */
  uint32_t                  RESERVED19[1U];      /**< Reserved for future use                            */
