SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_modem.h
#define _MODEM_SEQIEN_SQDET_SHIFT                               21                                                /**< Shift value for MODEM_SQDET                 */
#define _MODEM_SEQIEN_SQDET_MASK                                0x200000UL                                        /**< Bit mask for MODEM_SQDET                    */
#define _MODEM_SEQIEN_SQDET_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SQDET_DEFAULT                              (_MODEM_SEQIEN_SQDET_DEFAULT << 21)               /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SQNOTDET                                   (0x1UL << 22)                                     /**< SQ Not DET                                  */
#define _MODEM_SEQIEN_SQNOTDET_SHIFT                            22                                                /**< Shift value for MODEM_SQNOTDET              */
#define _MODEM_SEQIEN_SQNOTDET_MASK                             0x400000UL                                        /**< Bit mask for MODEM_SQNOTDET                 */
#define _MODEM_SEQIEN_SQNOTDET_DEFAULT                          0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SQNOTDET_DEFAULT                           (_MODEM_SEQIEN_SQNOTDET_DEFAULT << 22)            /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_ANTDIVRDY                                  (0x1UL << 23)                                     /**< RSSI and CORR data Ready                    */
#define _MODEM_SEQIEN_ANTDIVRDY_SHIFT                           23                                                /**< Shift value for MODEM_ANTDIVRDY             */
#define _MODEM_SEQIEN_ANTDIVRDY_MASK                            0x800000UL                                        /**< Bit mask for MODEM_ANTDIVRDY                */
#define _MODEM_SEQIEN_ANTDIVRDY_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_ANTDIVRDY_DEFAULT                          (_MODEM_SEQIEN_ANTDIVRDY_DEFAULT << 23)           /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SOFTRESETDONE                              (0x1UL << 24)                                     /**< Soft reset done                             */
#define _MODEM_SEQIEN_SOFTRESETDONE_SHIFT                       24                                                /**< Shift value for MODEM_SOFTRESETDONE         */
#define _MODEM_SEQIEN_SOFTRESETDONE_MASK                        0x1000000UL                                       /**< Bit mask for MODEM_SOFTRESETDONE            */
#define _MODEM_SEQIEN_SOFTRESETDONE_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SOFTRESETDONE_DEFAULT                      (_MODEM_SEQIEN_SOFTRESETDONE_DEFAULT << 24)       /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SQPRENOTDET                                (0x1UL << 25)                                     /**< SQ Not DET                                  */
#define _MODEM_SEQIEN_SQPRENOTDET_SHIFT                         25                                                /**< Shift value for MODEM_SQPRENOTDET           */
#define _MODEM_SEQIEN_SQPRENOTDET_MASK                          0x2000000UL                                       /**< Bit mask for MODEM_SQPRENOTDET              */
#define _MODEM_SEQIEN_SQPRENOTDET_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SQPRENOTDET_DEFAULT                        (_MODEM_SEQIEN_SQPRENOTDET_DEFAULT << 25)         /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SQFRAMENOTDET                              (0x1UL << 26)                                     /**< SQ Not DET                                  */
#define _MODEM_SEQIEN_SQFRAMENOTDET_SHIFT                       26                                                /**< Shift value for MODEM_SQFRAMENOTDET         */
#define _MODEM_SEQIEN_SQFRAMENOTDET_MASK                        0x4000000UL                                       /**< Bit mask for MODEM_SQFRAMENOTDET            */
#define _MODEM_SEQIEN_SQFRAMENOTDET_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SQFRAMENOTDET_DEFAULT                      (_MODEM_SEQIEN_SQFRAMENOTDET_DEFAULT << 26)       /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SQAFCOUTOFBAND                             (0x1UL << 27)                                     /**< SQ afc out of band                          */
#define _MODEM_SEQIEN_SQAFCOUTOFBAND_SHIFT                      27                                                /**< Shift value for MODEM_SQAFCOUTOFBAND        */
#define _MODEM_SEQIEN_SQAFCOUTOFBAND_MASK                       0x8000000UL                                       /**< Bit mask for MODEM_SQAFCOUTOFBAND           */
#define _MODEM_SEQIEN_SQAFCOUTOFBAND_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SQAFCOUTOFBAND_DEFAULT                     (_MODEM_SEQIEN_SQAFCOUTOFBAND_DEFAULT << 27)      /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SIDET                                      (0x1UL << 28)                                     /**< Signal Identified                           */
#define _MODEM_SEQIEN_SIDET_SHIFT                               28                                                /**< Shift value for MODEM_SIDET                 */
#define _MODEM_SEQIEN_SIDET_MASK                                0x10000000UL                                      /**< Bit mask for MODEM_SIDET                    */
#define _MODEM_SEQIEN_SIDET_DEFAULT                             0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SIDET_DEFAULT                              (_MODEM_SEQIEN_SIDET_DEFAULT << 28)               /**< Shifted mode DEFAULT for MODEM_SEQIEN       */
#define MODEM_SEQIEN_SIRESET                                    (0x1UL << 29)                                     /**< Signal identifier reset                     */
#define _MODEM_SEQIEN_SIRESET_SHIFT                             29                                                /**< Shift value for MODEM_SIRESET               */
#define _MODEM_SEQIEN_SIRESET_MASK                              0x20000000UL                                      /**< Bit mask for MODEM_SIRESET                  */
#define _MODEM_SEQIEN_SIRESET_DEFAULT                           0x00000000UL                                      /**< Mode DEFAULT for MODEM_SEQIEN               */
#define MODEM_SEQIEN_SIRESET_DEFAULT                            (_MODEM_SEQIEN_SIRESET_DEFAULT << 29)             /**< Shifted mode DEFAULT for MODEM_SEQIEN       */

/* Bit fields for MODEM STATUS */
#define _MODEM_STATUS_RESETVALUE                                0x00000000UL                                       /**< Default value for MODEM_STATUS              */
#define _MODEM_STATUS_MASK                                      0xFFFFFFFFUL                                       /**< Mask for MODEM_STATUS                       */
#define _MODEM_STATUS_DEMODSTATE_SHIFT                          0                                                  /**< Shift value for MODEM_DEMODSTATE            */
#define _MODEM_STATUS_DEMODSTATE_MASK                           0x7UL                                              /**< Bit mask for MODEM_DEMODSTATE               */
#define _MODEM_STATUS_DEMODSTATE_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define _MODEM_STATUS_DEMODSTATE_OFF                            0x00000000UL                                       /**< Mode OFF for MODEM_STATUS                   */
#define _MODEM_STATUS_DEMODSTATE_TIMINGSEARCH                   0x00000001UL                                       /**< Mode TIMINGSEARCH for MODEM_STATUS          */
#define _MODEM_STATUS_DEMODSTATE_PRESEARCH                      0x00000002UL                                       /**< Mode PRESEARCH for MODEM_STATUS             */
#define _MODEM_STATUS_DEMODSTATE_FRAMESEARCH                    0x00000003UL                                       /**< Mode FRAMESEARCH for MODEM_STATUS           */
#define _MODEM_STATUS_DEMODSTATE_RXFRAME                        0x00000004UL                                       /**< Mode RXFRAME for MODEM_STATUS               */
#define _MODEM_STATUS_DEMODSTATE_FRAMEDETMODE0                  0x00000005UL                                       /**< Mode FRAMEDETMODE0 for MODEM_STATUS         */
#define MODEM_STATUS_DEMODSTATE_DEFAULT                         (_MODEM_STATUS_DEMODSTATE_DEFAULT << 0)            /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_DEMODSTATE_OFF                             (_MODEM_STATUS_DEMODSTATE_OFF << 0)                /**< Shifted mode OFF for MODEM_STATUS           */
#define MODEM_STATUS_DEMODSTATE_TIMINGSEARCH                    (_MODEM_STATUS_DEMODSTATE_TIMINGSEARCH << 0)       /**< Shifted mode TIMINGSEARCH for MODEM_STATUS  */
#define MODEM_STATUS_DEMODSTATE_PRESEARCH                       (_MODEM_STATUS_DEMODSTATE_PRESEARCH << 0)          /**< Shifted mode PRESEARCH for MODEM_STATUS     */
#define MODEM_STATUS_DEMODSTATE_FRAMESEARCH                     (_MODEM_STATUS_DEMODSTATE_FRAMESEARCH << 0)        /**< Shifted mode FRAMESEARCH for MODEM_STATUS   */
#define MODEM_STATUS_DEMODSTATE_RXFRAME                         (_MODEM_STATUS_DEMODSTATE_RXFRAME << 0)            /**< Shifted mode RXFRAME for MODEM_STATUS       */
#define MODEM_STATUS_DEMODSTATE_FRAMEDETMODE0                   (_MODEM_STATUS_DEMODSTATE_FRAMEDETMODE0 << 0)      /**< Shifted mode FRAMEDETMODE0 for MODEM_STATUS */
#define MODEM_STATUS_BCRCFEDSADET                               (0x1UL << 3)                                       /**< BCR CFE DSA DETECTION                       */
#define _MODEM_STATUS_BCRCFEDSADET_SHIFT                        3                                                  /**< Shift value for MODEM_BCRCFEDSADET          */
#define _MODEM_STATUS_BCRCFEDSADET_MASK                         0x8UL                                              /**< Bit mask for MODEM_BCRCFEDSADET             */
#define _MODEM_STATUS_BCRCFEDSADET_DEFAULT                      0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_BCRCFEDSADET_DEFAULT                       (_MODEM_STATUS_BCRCFEDSADET_DEFAULT << 3)          /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_FRAMEDETID                                 (0x1UL << 4)                                       /**< Frame Detected ID                           */
#define _MODEM_STATUS_FRAMEDETID_SHIFT                          4                                                  /**< Shift value for MODEM_FRAMEDETID            */
#define _MODEM_STATUS_FRAMEDETID_MASK                           0x10UL                                             /**< Bit mask for MODEM_FRAMEDETID               */
#define _MODEM_STATUS_FRAMEDETID_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define _MODEM_STATUS_FRAMEDETID_FRAMEDET0                      0x00000000UL                                       /**< Mode FRAMEDET0 for MODEM_STATUS             */
#define _MODEM_STATUS_FRAMEDETID_FRAMEDET1                      0x00000001UL                                       /**< Mode FRAMEDET1 for MODEM_STATUS             */
#define MODEM_STATUS_FRAMEDETID_DEFAULT                         (_MODEM_STATUS_FRAMEDETID_DEFAULT << 4)            /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_FRAMEDETID_FRAMEDET0                       (_MODEM_STATUS_FRAMEDETID_FRAMEDET0 << 4)          /**< Shifted mode FRAMEDET0 for MODEM_STATUS     */
#define MODEM_STATUS_FRAMEDETID_FRAMEDET1                       (_MODEM_STATUS_FRAMEDETID_FRAMEDET1 << 4)          /**< Shifted mode FRAMEDET1 for MODEM_STATUS     */
#define MODEM_STATUS_ANTSEL                                     (0x1UL << 5)                                       /**< Selected Antenna                            */
#define _MODEM_STATUS_ANTSEL_SHIFT                              5                                                  /**< Shift value for MODEM_ANTSEL                */
#define _MODEM_STATUS_ANTSEL_MASK                               0x20UL                                             /**< Bit mask for MODEM_ANTSEL                   */
#define _MODEM_STATUS_ANTSEL_DEFAULT                            0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define _MODEM_STATUS_ANTSEL_ANTENNA0                           0x00000000UL                                       /**< Mode ANTENNA0 for MODEM_STATUS              */
#define _MODEM_STATUS_ANTSEL_ANTENNA1                           0x00000001UL                                       /**< Mode ANTENNA1 for MODEM_STATUS              */
#define MODEM_STATUS_ANTSEL_DEFAULT                             (_MODEM_STATUS_ANTSEL_DEFAULT << 5)                /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_ANTSEL_ANTENNA0                            (_MODEM_STATUS_ANTSEL_ANTENNA0 << 5)               /**< Shifted mode ANTENNA0 for MODEM_STATUS      */
#define MODEM_STATUS_ANTSEL_ANTENNA1                            (_MODEM_STATUS_ANTSEL_ANTENNA1 << 5)               /**< Shifted mode ANTENNA1 for MODEM_STATUS      */
#define MODEM_STATUS_TIMSEQINV                                  (0x1UL << 6)                                       /**< Timing Sequence Inverted                    */
#define _MODEM_STATUS_TIMSEQINV_SHIFT                           6                                                  /**< Shift value for MODEM_TIMSEQINV             */
#define _MODEM_STATUS_TIMSEQINV_MASK                            0x40UL                                             /**< Bit mask for MODEM_TIMSEQINV                */
#define _MODEM_STATUS_TIMSEQINV_DEFAULT                         0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_TIMSEQINV_DEFAULT                          (_MODEM_STATUS_TIMSEQINV_DEFAULT << 6)             /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_TIMLOSTCAUSE                               (0x1UL << 7)                                       /**< Timing Lost Cause                           */
#define _MODEM_STATUS_TIMLOSTCAUSE_SHIFT                        7                                                  /**< Shift value for MODEM_TIMLOSTCAUSE          */
#define _MODEM_STATUS_TIMLOSTCAUSE_MASK                         0x80UL                                             /**< Bit mask for MODEM_TIMLOSTCAUSE             */
#define _MODEM_STATUS_TIMLOSTCAUSE_DEFAULT                      0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define _MODEM_STATUS_TIMLOSTCAUSE_LOWCORR                      0x00000000UL                                       /**< Mode LOWCORR for MODEM_STATUS               */
#define _MODEM_STATUS_TIMLOSTCAUSE_TIMEOUT                      0x00000001UL                                       /**< Mode TIMEOUT for MODEM_STATUS               */
#define MODEM_STATUS_TIMLOSTCAUSE_DEFAULT                       (_MODEM_STATUS_TIMLOSTCAUSE_DEFAULT << 7)          /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_TIMLOSTCAUSE_LOWCORR                       (_MODEM_STATUS_TIMLOSTCAUSE_LOWCORR << 7)          /**< Shifted mode LOWCORR for MODEM_STATUS       */
#define MODEM_STATUS_TIMLOSTCAUSE_TIMEOUT                       (_MODEM_STATUS_TIMLOSTCAUSE_TIMEOUT << 7)          /**< Shifted mode TIMEOUT for MODEM_STATUS       */
#define MODEM_STATUS_DSADETECTED                                (0x1UL << 8)                                       /**< PHASE-DSA detected                          */
#define _MODEM_STATUS_DSADETECTED_SHIFT                         8                                                  /**< Shift value for MODEM_DSADETECTED           */
#define _MODEM_STATUS_DSADETECTED_MASK                          0x100UL                                            /**< Bit mask for MODEM_DSADETECTED              */
#define _MODEM_STATUS_DSADETECTED_DEFAULT                       0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_DSADETECTED_DEFAULT                        (_MODEM_STATUS_DSADETECTED_DEFAULT << 8)           /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_DSAFREQESTDONE                             (0x1UL << 9)                                       /**< DSA frequency estimation complete           */
#define _MODEM_STATUS_DSAFREQESTDONE_SHIFT                      9                                                  /**< Shift value for MODEM_DSAFREQESTDONE        */
#define _MODEM_STATUS_DSAFREQESTDONE_MASK                       0x200UL                                            /**< Bit mask for MODEM_DSAFREQESTDONE           */
#define _MODEM_STATUS_DSAFREQESTDONE_DEFAULT                    0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_DSAFREQESTDONE_DEFAULT                     (_MODEM_STATUS_DSAFREQESTDONE_DEFAULT << 9)        /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_VITERBIDEMODTIMDET                         (0x1UL << 10)                                      /**< Viterbi Demod timing detected               */
#define _MODEM_STATUS_VITERBIDEMODTIMDET_SHIFT                  10                                                 /**< Shift value for MODEM_VITERBIDEMODTIMDET    */
#define _MODEM_STATUS_VITERBIDEMODTIMDET_MASK                   0x400UL                                            /**< Bit mask for MODEM_VITERBIDEMODTIMDET       */
#define _MODEM_STATUS_VITERBIDEMODTIMDET_DEFAULT                0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_VITERBIDEMODTIMDET_DEFAULT                 (_MODEM_STATUS_VITERBIDEMODTIMDET_DEFAULT << 10)   /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_VITERBIDEMODFRAMEDET                       (0x1UL << 11)                                      /**< Viterbi Demod frame detected                */
#define _MODEM_STATUS_VITERBIDEMODFRAMEDET_SHIFT                11                                                 /**< Shift value for MODEM_VITERBIDEMODFRAMEDET  */
#define _MODEM_STATUS_VITERBIDEMODFRAMEDET_MASK                 0x800UL                                            /**< Bit mask for MODEM_VITERBIDEMODFRAMEDET     */
#define _MODEM_STATUS_VITERBIDEMODFRAMEDET_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_VITERBIDEMODFRAMEDET_DEFAULT               (_MODEM_STATUS_VITERBIDEMODFRAMEDET_DEFAULT << 11) /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define _MODEM_STATUS_STAMPSTATE_SHIFT                          12                                                 /**< Shift value for MODEM_STAMPSTATE            */
#define _MODEM_STATUS_STAMPSTATE_MASK                           0x7000UL                                           /**< Bit mask for MODEM_STAMPSTATE               */
#define _MODEM_STATUS_STAMPSTATE_DEFAULT                        0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_STAMPSTATE_DEFAULT                         (_MODEM_STATUS_STAMPSTATE_DEFAULT << 12)           /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define MODEM_STATUS_TRECSDSAADET                               (0x1UL << 15)                                      /**< TRECS DSA DETECTION                         */
#define _MODEM_STATUS_TRECSDSAADET_SHIFT                        15                                                 /**< Shift value for MODEM_TRECSDSAADET          */
#define _MODEM_STATUS_TRECSDSAADET_MASK                         0x8000UL                                           /**< Bit mask for MODEM_TRECSDSAADET             */
#define _MODEM_STATUS_TRECSDSAADET_DEFAULT                      0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_TRECSDSAADET_DEFAULT                       (_MODEM_STATUS_TRECSDSAADET_DEFAULT << 15)         /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define _MODEM_STATUS_CORR_SHIFT                                16                                                 /**< Shift value for MODEM_CORR                  */
#define _MODEM_STATUS_CORR_MASK                                 0xFF0000UL                                         /**< Bit mask for MODEM_CORR                     */
#define _MODEM_STATUS_CORR_DEFAULT                              0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_CORR_DEFAULT                               (_MODEM_STATUS_CORR_DEFAULT << 16)                 /**< Shifted mode DEFAULT for MODEM_STATUS       */
#define _MODEM_STATUS_WEAKSYMBOLS_SHIFT                         24                                                 /**< Shift value for MODEM_WEAKSYMBOLS           */
#define _MODEM_STATUS_WEAKSYMBOLS_MASK                          0xFF000000UL                                       /**< Bit mask for MODEM_WEAKSYMBOLS              */
#define _MODEM_STATUS_WEAKSYMBOLS_DEFAULT                       0x00000000UL                                       /**< Mode DEFAULT for MODEM_STATUS               */
#define MODEM_STATUS_WEAKSYMBOLS_DEFAULT                        (_MODEM_STATUS_WEAKSYMBOLS_DEFAULT << 24)          /**< Shifted mode DEFAULT for MODEM_STATUS       */

