SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_modem.h
/* Bit fields for MODEM PHDMODCTRL */
#define _MODEM_PHDMODCTRL_RESETVALUE                            0x01DF0004UL                                    /**< Default value for MODEM_PHDMODCTRL          */
#define _MODEM_PHDMODCTRL_MASK                                  0xFFFFFFFFUL                                    /**< Mask for MODEM_PHDMODCTRL                   */
#define _MODEM_PHDMODCTRL_PMDETTHD_SHIFT                        0                                               /**< Shift value for MODEM_PMDETTHD              */
#define _MODEM_PHDMODCTRL_PMDETTHD_MASK                         0x1FUL                                          /**< Bit mask for MODEM_PMDETTHD                 */
#define _MODEM_PHDMODCTRL_PMDETTHD_DEFAULT                      0x00000004UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMDETTHD_DEFAULT                       (_MODEM_PHDMODCTRL_PMDETTHD_DEFAULT << 0)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_SHIFT                     5                                               /**< Shift value for MODEM_PMTIMLOSTHD           */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_MASK                      0x1FE0UL                                        /**< Bit mask for MODEM_PMTIMLOSTHD              */
#define _MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT                    (_MODEM_PHDMODCTRL_PMTIMLOSTHD_DEFAULT << 5)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_PMTIMLOSEN                             (0x1UL << 13)                                   /**< Preamble timing loss detection              */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_SHIFT                      13                                              /**< Shift value for MODEM_PMTIMLOSEN            */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_MASK                       0x2000UL                                        /**< Bit mask for MODEM_PMTIMLOSEN               */
#define _MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT                     (_MODEM_PHDMODCTRL_PMTIMLOSEN_DEFAULT << 13)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_RSSIFLTBYP                             (0x1UL << 14)                                   /**< Bypass RSSI Filering                        */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_SHIFT                      14                                              /**< Shift value for MODEM_RSSIFLTBYP            */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_MASK                       0x4000UL                                        /**< Bit mask for MODEM_RSSIFLTBYP               */
#define _MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT                     (_MODEM_PHDMODCTRL_RSSIFLTBYP_DEFAULT << 14)    /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_PMDETEN                                (0x1UL << 15)                                   /**< PREAMBLE DET                                */
#define _MODEM_PHDMODCTRL_PMDETEN_SHIFT                         15                                              /**< Shift value for MODEM_PMDETEN               */
#define _MODEM_PHDMODCTRL_PMDETEN_MASK                          0x8000UL                                        /**< Bit mask for MODEM_PMDETEN                  */
#define _MODEM_PHDMODCTRL_PMDETEN_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_PMDETEN_DEFAULT                        (_MODEM_PHDMODCTRL_PMDETEN_DEFAULT << 15)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODOSR_SHIFT                        16                                              /**< Shift value for MODEM_REMODOSR              */
#define _MODEM_PHDMODCTRL_REMODOSR_MASK                         0x3F0000UL                                      /**< Bit mask for MODEM_REMODOSR                 */
#define _MODEM_PHDMODCTRL_REMODOSR_DEFAULT                      0x0000001FUL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODOSR_DEFAULT                       (_MODEM_PHDMODCTRL_REMODOSR_DEFAULT << 16)      /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODDWN_SHIFT                        22                                              /**< Shift value for MODEM_REMODDWN              */
#define _MODEM_PHDMODCTRL_REMODDWN_MASK                         0x3C00000UL                                     /**< Bit mask for MODEM_REMODDWN                 */
#define _MODEM_PHDMODCTRL_REMODDWN_DEFAULT                      0x00000007UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODDWN_DEFAULT                       (_MODEM_PHDMODCTRL_REMODDWN_DEFAULT << 22)      /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_SHIFT                     26                                              /**< Shift value for MODEM_REMODOUTSEL           */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_MASK                      0xC000000UL                                     /**< Bit mask for MODEM_REMODOUTSEL              */
#define _MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT                    (_MODEM_PHDMODCTRL_REMODOUTSEL_DEFAULT << 26)   /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_REMODEN                                (0x1UL << 28)                                   /**< REMOD ENABLE                                */
#define _MODEM_PHDMODCTRL_REMODEN_SHIFT                         28                                              /**< Shift value for MODEM_REMODEN               */
#define _MODEM_PHDMODCTRL_REMODEN_MASK                          0x10000000UL                                    /**< Bit mask for MODEM_REMODEN                  */
#define _MODEM_PHDMODCTRL_REMODEN_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_REMODEN_DEFAULT                        (_MODEM_PHDMODCTRL_REMODEN_DEFAULT << 28)       /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRDETECTOR                            (0x1UL << 29)                                   /**< Enbale BCRDMOD Dtetector ONLY               */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_SHIFT                     29                                              /**< Shift value for MODEM_BCRDETECTOR           */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_MASK                      0x20000000UL                                    /**< Bit mask for MODEM_BCRDETECTOR              */
#define _MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT                   0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT                    (_MODEM_PHDMODCTRL_BCRDETECTOR_DEFAULT << 29)   /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRTRECSCONC                           (0x1UL << 30)                                   /**< BCR/LEGACY CONCURRENT MODE                  */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_SHIFT                    30                                              /**< Shift value for MODEM_BCRTRECSCONC          */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_MASK                     0x40000000UL                                    /**< Bit mask for MODEM_BCRTRECSCONC             */
#define _MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT                   (_MODEM_PHDMODCTRL_BCRTRECSCONC_DEFAULT << 30)  /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */
#define MODEM_PHDMODCTRL_BCRLEGACYCONC                          (0x1UL << 31)                                   /**< BCR/TRECS CONCURRENT MODE                   */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_SHIFT                   31                                              /**< Shift value for MODEM_BCRLEGACYCONC         */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_MASK                    0x80000000UL                                    /**< Bit mask for MODEM_BCRLEGACYCONC            */
#define _MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_PHDMODCTRL           */
#define MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT                  (_MODEM_PHDMODCTRL_BCRLEGACYCONC_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_PHDMODCTRL   */

