SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_modem.h
/* Bit fields for MODEM ADFSM30 */
#define _MODEM_ADFSM30_RESETVALUE                               0x00000000UL                                /**< Default value for MODEM_ADFSM30             */
#define _MODEM_ADFSM30_MASK                                     0xFFFFFFFFUL                                /**< Mask for MODEM_ADFSM30                      */
#define _MODEM_ADFSM30_ADODEMODRXREQ_SHIFT                      0                                           /**< Shift value for MODEM_ADODEMODRXREQ         */
#define _MODEM_ADFSM30_ADODEMODRXREQ_MASK                       0xFFFFFFFFUL                                /**< Bit mask for MODEM_ADODEMODRXREQ            */
#define _MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT                    0x00000000UL                                /**< Mode DEFAULT for MODEM_ADFSM30              */
#define MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT                     (_MODEM_ADFSM30_ADODEMODRXREQ_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADFSM30      */

/* Bit fields for MODEM ADPC1 */
#define _MODEM_ADPC1_RESETVALUE                                 0x01200040UL                                   /**< Default value for MODEM_ADPC1               */
#define _MODEM_ADPC1_MASK                                       0xFFFF7FFFUL                                   /**< Mask for MODEM_ADPC1                        */
#define MODEM_ADPC1_ADPCEN                                      (0x1UL << 0)                                   /**< ADPC enable                                 */
#define _MODEM_ADPC1_ADPCEN_SHIFT                               0                                              /**< Shift value for MODEM_ADPCEN                */
#define _MODEM_ADPC1_ADPCEN_MASK                                0x1UL                                          /**< Bit mask for MODEM_ADPCEN                   */
#define _MODEM_ADPC1_ADPCEN_DEFAULT                             0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCEN_DEFAULT                              (_MODEM_ADPC1_ADPCEN_DEFAULT << 0)             /**< Shifted mode DEFAULT for MODEM_ADPC1        */
#define _MODEM_ADPC1_ADPCWNDSIZECHIP_SHIFT                      1                                              /**< Shift value for MODEM_ADPCWNDSIZECHIP       */
#define _MODEM_ADPC1_ADPCWNDSIZECHIP_MASK                       0xFEUL                                         /**< Bit mask for MODEM_ADPCWNDSIZECHIP          */
#define _MODEM_ADPC1_ADPCWNDSIZECHIP_DEFAULT                    0x00000020UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCWNDSIZECHIP_DEFAULT                     (_MODEM_ADPC1_ADPCWNDSIZECHIP_DEFAULT << 1)    /**< Shifted mode DEFAULT for MODEM_ADPC1        */
#define _MODEM_ADPC1_ADPCCORROFFSETCHIP_SHIFT                   8                                              /**< Shift value for MODEM_ADPCCORROFFSETCHIP    */
#define _MODEM_ADPC1_ADPCCORROFFSETCHIP_MASK                    0x7F00UL                                       /**< Bit mask for MODEM_ADPCCORROFFSETCHIP       */
#define _MODEM_ADPC1_ADPCCORROFFSETCHIP_DEFAULT                 0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCCORROFFSETCHIP_DEFAULT                  (_MODEM_ADPC1_ADPCCORROFFSETCHIP_DEFAULT << 8) /**< Shifted mode DEFAULT for MODEM_ADPC1        */
#define _MODEM_ADPC1_ADPCTIMINGBAUDS_SHIFT                      16                                             /**< Shift value for MODEM_ADPCTIMINGBAUDS       */
#define _MODEM_ADPC1_ADPCTIMINGBAUDS_MASK                       0xFF0000UL                                     /**< Bit mask for MODEM_ADPCTIMINGBAUDS          */
#define _MODEM_ADPC1_ADPCTIMINGBAUDS_DEFAULT                    0x00000020UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCTIMINGBAUDS_DEFAULT                     (_MODEM_ADPC1_ADPCTIMINGBAUDS_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_ADPC1        */
#define _MODEM_ADPC1_ADPCWNDCNT_SHIFT                           24                                             /**< Shift value for MODEM_ADPCWNDCNT            */
#define _MODEM_ADPC1_ADPCWNDCNT_MASK                            0x7000000UL                                    /**< Bit mask for MODEM_ADPCWNDCNT               */
#define _MODEM_ADPC1_ADPCWNDCNT_DEFAULT                         0x00000001UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCWNDCNT_DEFAULT                          (_MODEM_ADPC1_ADPCWNDCNT_DEFAULT << 24)        /**< Shifted mode DEFAULT for MODEM_ADPC1        */
#define _MODEM_ADPC1_ADPCSKIPCHIPS_SHIFT                        27                                             /**< Shift value for MODEM_ADPCSKIPCHIPS         */
#define _MODEM_ADPC1_ADPCSKIPCHIPS_MASK                         0xF8000000UL                                   /**< Bit mask for MODEM_ADPCSKIPCHIPS            */
#define _MODEM_ADPC1_ADPCSKIPCHIPS_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_ADPC1                */
#define MODEM_ADPC1_ADPCSKIPCHIPS_DEFAULT                       (_MODEM_ADPC1_ADPCSKIPCHIPS_DEFAULT << 27)     /**< Shifted mode DEFAULT for MODEM_ADPC1        */

/* Bit fields for MODEM ADPC2 */
#define _MODEM_ADPC2_RESETVALUE                                 0x000000A0UL                                    /**< Default value for MODEM_ADPC2               */
#define _MODEM_ADPC2_MASK                                       0x3FFFFFFFUL                                    /**< Mask for MODEM_ADPC2                        */
#define _MODEM_ADPC2_ADPCCORRSAMPLES_SHIFT                      0                                               /**< Shift value for MODEM_ADPCCORRSAMPLES       */
#define _MODEM_ADPC2_ADPCCORRSAMPLES_MASK                       0x3FFUL                                         /**< Bit mask for MODEM_ADPCCORRSAMPLES          */
#define _MODEM_ADPC2_ADPCCORRSAMPLES_DEFAULT                    0x000000A0UL                                    /**< Mode DEFAULT for MODEM_ADPC2                */
#define MODEM_ADPC2_ADPCCORRSAMPLES_DEFAULT                     (_MODEM_ADPC2_ADPCCORRSAMPLES_DEFAULT << 0)     /**< Shifted mode DEFAULT for MODEM_ADPC2        */
#define _MODEM_ADPC2_ADPCPRETIMINGBAUDS_SHIFT                   10                                              /**< Shift value for MODEM_ADPCPRETIMINGBAUDS    */
#define _MODEM_ADPC2_ADPCPRETIMINGBAUDS_MASK                    0x3FC00UL                                       /**< Bit mask for MODEM_ADPCPRETIMINGBAUDS       */
#define _MODEM_ADPC2_ADPCPRETIMINGBAUDS_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC2                */
#define MODEM_ADPC2_ADPCPRETIMINGBAUDS_DEFAULT                  (_MODEM_ADPC2_ADPCPRETIMINGBAUDS_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ADPC2        */
#define MODEM_ADPC2_ADENCORR32                                  (0x1UL << 18)                                   /**< ADPC enable correlators 16-31               */
#define _MODEM_ADPC2_ADENCORR32_SHIFT                           18                                              /**< Shift value for MODEM_ADENCORR32            */
#define _MODEM_ADPC2_ADENCORR32_MASK                            0x40000UL                                       /**< Bit mask for MODEM_ADENCORR32               */
#define _MODEM_ADPC2_ADENCORR32_DEFAULT                         0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC2                */
#define _MODEM_ADPC2_ADENCORR32_DISABLE                         0x00000000UL                                    /**< Mode DISABLE for MODEM_ADPC2                */
#define _MODEM_ADPC2_ADENCORR32_ENABLE                          0x00000001UL                                    /**< Mode ENABLE for MODEM_ADPC2                 */
#define MODEM_ADPC2_ADENCORR32_DEFAULT                          (_MODEM_ADPC2_ADENCORR32_DEFAULT << 18)         /**< Shifted mode DEFAULT for MODEM_ADPC2        */
#define MODEM_ADPC2_ADENCORR32_DISABLE                          (_MODEM_ADPC2_ADENCORR32_DISABLE << 18)         /**< Shifted mode DISABLE for MODEM_ADPC2        */
#define MODEM_ADPC2_ADENCORR32_ENABLE                           (_MODEM_ADPC2_ADENCORR32_ENABLE << 18)          /**< Shifted mode ENABLE for MODEM_ADPC2         */
#define _MODEM_ADPC2_ADPCSIGAMPTHR_SHIFT                        19                                              /**< Shift value for MODEM_ADPCSIGAMPTHR         */
#define _MODEM_ADPC2_ADPCSIGAMPTHR_MASK                         0x7F80000UL                                     /**< Bit mask for MODEM_ADPCSIGAMPTHR            */
#define _MODEM_ADPC2_ADPCSIGAMPTHR_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC2                */
#define MODEM_ADPC2_ADPCSIGAMPTHR_DEFAULT                       (_MODEM_ADPC2_ADPCSIGAMPTHR_DEFAULT << 19)      /**< Shifted mode DEFAULT for MODEM_ADPC2        */
#define _MODEM_ADPC2_ADPCWNDCNTRST_SHIFT                        27                                              /**< Shift value for MODEM_ADPCWNDCNTRST         */
#define _MODEM_ADPC2_ADPCWNDCNTRST_MASK                         0x38000000UL                                    /**< Bit mask for MODEM_ADPCWNDCNTRST            */
#define _MODEM_ADPC2_ADPCWNDCNTRST_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC2                */
#define MODEM_ADPC2_ADPCWNDCNTRST_DEFAULT                       (_MODEM_ADPC2_ADPCWNDCNTRST_DEFAULT << 27)      /**< Shifted mode DEFAULT for MODEM_ADPC2        */

/* Bit fields for MODEM ADPC3 */
#define _MODEM_ADPC3_RESETVALUE                                 0x01005008UL                                    /**< Default value for MODEM_ADPC3               */
#define _MODEM_ADPC3_MASK                                       0x03FFFFFFUL                                    /**< Mask for MODEM_ADPC3                        */
#define MODEM_ADPC3_ADBBSSEN                                    (0x1UL << 0)                                    /**< ADBBSS enable                               */
#define _MODEM_ADPC3_ADBBSSEN_SHIFT                             0                                               /**< Shift value for MODEM_ADBBSSEN              */
#define _MODEM_ADPC3_ADBBSSEN_MASK                              0x1UL                                           /**< Bit mask for MODEM_ADBBSSEN                 */
#define _MODEM_ADPC3_ADBBSSEN_DEFAULT                           0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSEN_DEFAULT                            (_MODEM_ADPC3_ADBBSSEN_DEFAULT << 0)            /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define _MODEM_ADPC3_ADBBSSFILTLENGTH_SHIFT                     1                                               /**< Shift value for MODEM_ADBBSSFILTLENGTH      */
#define _MODEM_ADPC3_ADBBSSFILTLENGTH_MASK                      0xEUL                                           /**< Bit mask for MODEM_ADBBSSFILTLENGTH         */
#define _MODEM_ADPC3_ADBBSSFILTLENGTH_DEFAULT                   0x00000004UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSFILTLENGTH_DEFAULT                    (_MODEM_ADPC3_ADBBSSFILTLENGTH_DEFAULT << 1)    /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define MODEM_ADPC3_ADBBSSAVGEN                                 (0x1UL << 4)                                    /**< ADBBSS average enable                       */
#define _MODEM_ADPC3_ADBBSSAVGEN_SHIFT                          4                                               /**< Shift value for MODEM_ADBBSSAVGEN           */
#define _MODEM_ADPC3_ADBBSSAVGEN_MASK                           0x10UL                                          /**< Bit mask for MODEM_ADBBSSAVGEN              */
#define _MODEM_ADPC3_ADBBSSAVGEN_DEFAULT                        0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAVGEN_DEFAULT                         (_MODEM_ADPC3_ADBBSSAVGEN_DEFAULT << 4)         /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define _MODEM_ADPC3_ADBBSSAVGPER_SHIFT                         5                                               /**< Shift value for MODEM_ADBBSSAVGPER          */
#define _MODEM_ADPC3_ADBBSSAVGPER_MASK                          0xE0UL                                          /**< Bit mask for MODEM_ADBBSSAVGPER             */
#define _MODEM_ADPC3_ADBBSSAVGPER_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAVGPER_DEFAULT                        (_MODEM_ADPC3_ADBBSSAVGPER_DEFAULT << 5)        /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define _MODEM_ADPC3_ADBBSSAMPMANT_SHIFT                        8                                               /**< Shift value for MODEM_ADBBSSAMPMANT         */
#define _MODEM_ADPC3_ADBBSSAMPMANT_MASK                         0xF00UL                                         /**< Bit mask for MODEM_ADBBSSAMPMANT            */
#define _MODEM_ADPC3_ADBBSSAMPMANT_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAMPMANT_DEFAULT                       (_MODEM_ADPC3_ADBBSSAMPMANT_DEFAULT << 8)       /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define _MODEM_ADPC3_ADBBSSAMPEXP_SHIFT                         12                                              /**< Shift value for MODEM_ADBBSSAMPEXP          */
#define _MODEM_ADPC3_ADBBSSAMPEXP_MASK                          0xF000UL                                        /**< Bit mask for MODEM_ADBBSSAMPEXP             */
#define _MODEM_ADPC3_ADBBSSAMPEXP_DEFAULT                       0x00000005UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAMPEXP_DEFAULT                        (_MODEM_ADPC3_ADBBSSAMPEXP_DEFAULT << 12)       /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define _MODEM_ADPC3_ADBBSSAVGWAIT_SHIFT                        16                                              /**< Shift value for MODEM_ADBBSSAVGWAIT         */
#define _MODEM_ADPC3_ADBBSSAVGWAIT_MASK                         0xFF0000UL                                      /**< Bit mask for MODEM_ADBBSSAVGWAIT            */
#define _MODEM_ADPC3_ADBBSSAVGWAIT_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAVGWAIT_DEFAULT                       (_MODEM_ADPC3_ADBBSSAVGWAIT_DEFAULT << 16)      /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define MODEM_ADPC3_ADBBSSAVGFREEZE                             (0x1UL << 24)                                   /**< ADBBSS average freeze                       */
#define _MODEM_ADPC3_ADBBSSAVGFREEZE_SHIFT                      24                                              /**< Shift value for MODEM_ADBBSSAVGFREEZE       */
#define _MODEM_ADPC3_ADBBSSAVGFREEZE_MASK                       0x1000000UL                                     /**< Bit mask for MODEM_ADBBSSAVGFREEZE          */
#define _MODEM_ADPC3_ADBBSSAVGFREEZE_DEFAULT                    0x00000001UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define MODEM_ADPC3_ADBBSSAVGFREEZE_DEFAULT                     (_MODEM_ADPC3_ADBBSSAVGFREEZE_DEFAULT << 24)    /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define MODEM_ADPC3_ADBBSSSELWRDATA                             (0x1UL << 25)                                   /**< ADBBSS select RAM write data                */
#define _MODEM_ADPC3_ADBBSSSELWRDATA_SHIFT                      25                                              /**< Shift value for MODEM_ADBBSSSELWRDATA       */
#define _MODEM_ADPC3_ADBBSSSELWRDATA_MASK                       0x2000000UL                                     /**< Bit mask for MODEM_ADBBSSSELWRDATA          */
#define _MODEM_ADPC3_ADBBSSSELWRDATA_DEFAULT                    0x00000000UL                                    /**< Mode DEFAULT for MODEM_ADPC3                */
#define _MODEM_ADPC3_ADBBSSSELWRDATA_ADBBSS                     0x00000000UL                                    /**< Mode ADBBSS for MODEM_ADPC3                 */
#define _MODEM_ADPC3_ADBBSSSELWRDATA_DATAFILTER                 0x00000001UL                                    /**< Mode DATAFILTER for MODEM_ADPC3             */
#define MODEM_ADPC3_ADBBSSSELWRDATA_DEFAULT                     (_MODEM_ADPC3_ADBBSSSELWRDATA_DEFAULT << 25)    /**< Shifted mode DEFAULT for MODEM_ADPC3        */
#define MODEM_ADPC3_ADBBSSSELWRDATA_ADBBSS                      (_MODEM_ADPC3_ADBBSSSELWRDATA_ADBBSS << 25)     /**< Shifted mode ADBBSS for MODEM_ADPC3         */
#define MODEM_ADPC3_ADBBSSSELWRDATA_DATAFILTER                  (_MODEM_ADPC3_ADBBSSSELWRDATA_DATAFILTER << 25) /**< Shifted mode DATAFILTER for MODEM_ADPC3     */

